from PIL import Image as Pil
import os
os.environ['TF_CPP_MIN_LOG_LEVEL'] = '2'
import cv2 as cv
from tensorflow.keras.models import load_model as lm
import numpy as np

def open(name):
    img = cv.imread(os.path.join(os.getcwd(), name))
    img = Pil.fromarray(img)
    img = img.resize((30, 30))
    img = np.expand_dims(img, axis=0)
    img = np.array(img)
    return img

classes = {1: 'Обмеження швидкості (20km/h)',
           2: 'Обмеження швидкості (30km/h)',
           3: 'Обмеження швидкості (50km/h)',
           4: 'Обмеження швидкості (60km/h)',
           5: 'Обмеження швидкості (70km/h)',
           6: 'Обмеження швидкості (80km/h)',
           7: 'Зняття обмеження швидкості (80km/h)',
           8: 'Обмеження швидкості (100km/h)',
           9: 'Обмеження швидкості (120km/h)',
           10: 'Обгін заборонено',
           11: 'Обгін заборонено вантажівкам > 3.5 тонн',
           12: 'Перетин другорядною дорогою',
           13: 'Головна дорога',
           14: 'Дати дорогу',
           15: 'СТОП',
           16: 'Рух заборонено',
           17: 'Рух заборонено вантажівкам > 3.5 тонн',
           18: "В'їзд заборонено",
           19: 'Наближення до небезпечної ділянки дороги',
           20: 'Небезпечний поворот ліворуч',
           21: 'Небезпечний поворот праворуч',
           22: 'Подвійний поворот',
           23: 'Нерівності на дорозі',
           24: 'Слизька дорога',
           25: 'Звуження дороги праворуч',
           26: 'Дорожні роботи',
           27: 'Світлофорне регулювання',
           28: 'Пішоходи',
           29: 'Діти (поперелдувальний знак)',
           30: 'Виїзд велосипедистів',
           31: 'Сніг/лід (попереджувальний знак)',
           32: 'Вихід диких звірів',
           33: 'Кінець заборон і обмежень',
           34: 'Поворот праворуч на перехресті',
           35: 'Поворот ліворуч на перехресті',
           36: 'Рух лише прямо',
           37: 'Прямо або праворуч',
           38: 'Прямо або ліворуч',
           39: "З'їзд праворуч",
           40: "З'їзд ліворуч",
           41: 'Кільцевий рух',
           42: 'Кінець заборони обгону',
           43: 'Кінець заборони обгону вантажівкам > 3.5 тонн'}

model = lm('test_model.h5')

while True:
    a = input("Введіть ім'я файлу (з розширенням) або команду 'close': ")
    if a == 'close':
        break
    else:
        img = open(a)
        res = model.predict(img)
        res = np.argmax(res)
        res = classes[res + 1]
        print(f"Розпізнаний знак: {res}")